backend/app/Models/BaseCaseModel.php

    function GetKasus(){
        return $this->builder   ->select('base_case.*, kasus.*, siswa.*, minat_bakat.*')
                                ->join('kasus', 'kasus.id_kasus = base_case.id_kasus')
                                ->join('minat_bakat', 'minat_bakat.id_minatbakat = kasus.id_minatbakat')
                                ->join('siswa', 'kasus.id_siswa = siswa.id_siswa')
                                ->get()
                                ->getResultArray();
---
SELECT `base_case`.*, `kasus`.*, `minat_bakat`.*
FROM `base_case`
JOIN `kasus` ON `kasus`.`id_kasus` = `base_case`.`id_kasus`
JOIN `minat_bakat` ON `minat_bakat`.`id_minatbakat` = `kasus`.`id_minatbakat`