backend/app/Models/KasusModel.php

    function GetKasus(){
        return $this->builder   ->select('kasus.*, siswa.*')
                                ->join('siswa', 'kasus.id_siswa = siswa.id_siswa')
                                ->get()
                                ->getResultArray();
---
SELECT `kasus`.*, `siswa`.`umur`
FROM `kasus`
JOIN `siswa` ON `kasus`.`id_siswa` = `siswa`.`id_siswa`